
{
  "categories": [
    {
      "title": "Inteligência & Consultoria DBA",
      "icon": "Bot",
      "items": [
        {
          "title": "IA SQL Architect (NLP to SQL)",
          "desc": "Tradução de linguagem natural em queries complexas e performáticas utilizando modelos Gemini 3 Flash/Pro.",
          "status": "Finalizado",
          "implementationPlan": [
            "Motor de inferência baseado no contexto do schema real.",
            "Validação sintática automática pós-geração.",
            "Explicação didática da lógica aplicada."
          ]
        },
        {
          "title": "Monitor de Saúde Enterprise (Advanced Telemetry)",
          "desc": "Telemetria profunda: Análise de Wait Events, árvore de bloqueios, detecção de índices inúteis e monitoramento de transação wraparound.",
          "status": "Finalizado",
          "implementationPlan": [
            "Técnica: Agregadores de pg_stat_activity com wait_event_type categorizado.",
            "Diagnóstico: Identificação de índices redundantes com idx_scan = 0.",
            "Segurança: Alerta visual de Transaction Wraparound baseado em age(datfrozenxid)."
          ]
        },
        {
          "title": "Exportação de Snapshot de Diagnóstico",
          "desc": "Gerador de relatórios técnicos em JSON/TXT contendo métricas, locks e plano de saúde do banco para compartilhamento.",
          "status": "Finalizado",
          "implementationPlan": [
            "UI: Botões dedicados no topo da tela de Saúde.",
            "Técnica: Captura serializada do estado atual de telemetria.",
            "Recurso: Geração de arquivos offline para auditoria externa."
          ]
        }
      ]
    },
    {
      "title": "UX & Visualização Avançada",
      "icon": "Eye",
      "items": [
        {
          "title": "Mapa Interativo do Schema",
          "desc": "Canvas infinito para visualização de tabelas, relacionamentos FK e validação de interseção de dados entre colunas.",
          "status": "Finalizado",
          "implementationPlan": [
            "Layout automático baseado em densidade de conexões.",
            "Busca global de campos e tabelas com zoom dinâmico.",
            "Validador de interseção real para criação de FKs virtuais."
          ]
        },
        {
          "title": "Visual Explain Timeline (Gantt)",
          "desc": "Transformação do EXPLAIN ANALYZE em um gráfico de Gantt visual, mostrando cronologicamente onde cada Join ou Scan gastou tempo.",
          "status": "Planejado",
          "implementationPlan": [
            "Parsing de planos de execução JSON do PostgreSQL.",
            "Destaque visual de gargalos de I/O e CPU por nó.",
            "Comparação visual entre dois planos de execução."
          ]
        },
        {
          "title": "Natural Language to Charts",
          "desc": "IA que analisa os resultados da query e sugere o melhor gráfico para visualização dos dados automaticamente.",
          "status": "Finalizado"
        }
      ]
    },
    {
      "title": "Engenharia & Produtividade",
      "icon": "Zap",
      "items": [
        {
          "title": "Data Diff & Auditoria",
          "desc": "Ferramenta para comparar registros entre tabelas ou instâncias, identificando divergências em segundos.",
          "status": "Finalizado"
        },
        {
          "title": "Log Analyzer & SQL Extractor",
          "desc": "Extrator de comandos SQL de arquivos de log sujos e diagnóstico de erros via IA para proposição de correções.",
          "status": "Finalizado"
        },
        {
          "title": "Suporte Multi-Banco (MySQL/SQLite)",
          "desc": "Expansão do motor de drivers para suportar outros dialetos SQL comuns no ecossistema dev.",
          "status": "Em Discussão"
        }
      ]
    }
  ]
}
